In [2]:
import pandas as pd

In [3]:
employees = pd.read_excel('H+ Sport Employees.xlsx', sheet_name="Employees-Table")

In [6]:
employees.head()

,Employee Name,Building,Department,Status,Hire Date,Month,Years,Benefits,Salary
0,"Page, Lisa",West,ADC,Full Time,1999-01-11,Jan,25,DMR,24550
1,"Taylor, Hector",West,ADC,Half-Time,2011-02-21,Feb,12,DM,26795
2,"Dawson, Jonathan",West,ADC,Contract,2007-03-06,Mar,16,NaN,42540
3,"Duran, Brian",Taft,ADC,Hourly,2012-08-30,Aug,11,NaN,35680
4,"Weber, Larry",Watson,ADC,Full Time,2007-12-31,Dec,16,M,72830

In [ ]:
#dropping columns
#axis=1 means columns
#axis=0 means rows

employees.drop(['Job Rating', 'New Salary', 'Tax Rate', '2.91%'], axis=1, inplace=True)

In [7]:
employees.columns

Index(['Employee Name', 'Building', 'Department', 'Status', 'Hire Date',
       'Month', 'Years', 'Benefits', 'Salary'],
      dtype='object')